---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementCalculationPoint.Position
source: html/075179a0-ad84-9333-7d58-7c3625603b26.htm
---
# Autodesk.Revit.DB.SpatialElementCalculationPoint.Position Property

The position of the "in" spatial element calculation point.

## Syntax (C#)
```csharp
public XYZ Position { get; set; }
```

## Remarks
This is the search point where a family instance will be considered to be located inside a room/space.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null